{
  "about": {
    "title": "who’d have thought insurance\ncould be beautiful?",
    "subtitle": "when it’s as simple as blend, it can be",
    "blurb":
      "We’re blend, the Accident & Health and Niche Personal Lines insurance experts. Our core offering is the design and delivery of optimised solutions tailored for, and targeted at, groups of businesses and individuals. We also work on large individual risk accounts and alongside specialist brokers on portfolios in the Accident & Health sector.\nThis is just the beginning for blend, and that means there’s more exciting stuff in the works for you and your customers, too. Read on to discover our available products, and get in touch to keep up to date with all the latest blend developments."
  },
  "contact": {
    "title": "we could be the perfect blend",
    "blurb":
      "Let’s work together. Whether you need to chat about your clients’ insurance needs, a new product or partnership idea, or something else altogether, we’d love to hear from you. We’re responsive, responsible and reliable, so sing out, and we’ll sing right back.",
    "thankYou":
      "Thank you for your enquiry.\nA member of our team will be in touch with you shortly.",
    "purposes": [
      "new broker enquiries",
      "existing broker submissions",
      "claims enquiries",
      "other enquiries"
    ]
  },
  "cover": {
    "title": "we’ve got you covered",
    "subtitle": "it’s insurance, the way you need it to be",
    "blurb":
      "Whether your clients’ insurance cover needs are straightforward or a little more niche than usual, we’ve got the solution. As a blend broker, you can access standard Accident & Health cover, or tailor a bespoke policy that’s particular to your clients’ circumstances.\nThese products are in support of large accounts and our specialist Accident & Health broker partners."
  },
  "focus": {
    "title": "it’s your world,\nwe just live in it",
    "subtitle": "a thoughtful approach to insurance solutions",
    "blurb":
      "Sustainable businesses are built on strong relationships, and that’s why honesty, transparency and flexibility are so central to our approach. While we’re excited to guide your clients with our expertise, we’re not here to tell them what to do. We design solutions with people, for people. Our service stays nimble so your clients’ expectations are continually met, and we add value to you by improving your workflow, revenue and customer offering through technology-driven solutions."
  },
  "home": {
    "title":
      "powerfully simple. simply powerful.\nwe’re making it easier to feel connected to your insurance."
  },
  "tech": {
    "title": "tech to enable",
    "subtitle":
      "an agile and highly scalable broker and partner\nuser experience is on its way",
    "blurb":
      "We’re focused on creating best-in-class technology solutions, enabling you to interact with us on your terms. We know that you have preferred ways of working and distribution partners have their preferred approach to integration, so instead of disrupting that, we want to complement it so that every interaction you have with us is simple."
  }
}
