{
  "about": {
    "title": "who’d have thought insurance\ncould be beautiful?",
    "subtitle": "when it’s as simple as blend, it can be",
    "blurb":
      "We’re Blend, A&H and Niche Personal Lines insurance experts at your service. Our core specialty is the design and delivery of optimised solutions tailored for, and targeted at, groups of businesses and/or individuals. In addition to that we also work on large Individual risk accounts as well as with speciality brokers with portfolios in the Accident & Health sector.\nThis is just the beginning for blend, and that means there’s more exciting stuff in the works for you and your customers, too. Read on to discover our available products, and get in touch to keep up to date with all the latest blend developments."
  },
  "contact": {
    "title": "we could be the perfect blend",
    "blurb":
      "Let’s work together. Whether you need to chat about your clients’ insurance needs, a new product or partnership idea, or something else altogether, we’d love to hear from you. We’re responsive, responsible and reliable, so sing out, and we’ll sing right back.",
    "thankYou":
      "Thank you for your enquiry.\nA member of our team will be in touch with you shortly.",
    "purposes": [
      "new broker enquiries",
      "existing broker submissions",
      "claims enquiries",
      "other enquiries"
    ]
  },
  "cover": {
    "title": "we’ve got you covered",
    "blurb":
      "We have developed an extensive suite of benefits that allow us to tailor a bundled solution, aligned to the characteristics and needs of differing customer groups.\nWhether your clients’ insurance cover needs are straightforward or a little more bespoke than usual, we’ve got the solution. As a blend broker, you can access standard Accident and Health cover, or tailor a bespoke policy that’s particular to your clients’ circumstances.\nIn support of large accounts and our speciality A&H broker partners we have the following existing products."
  },
  "focus": {
    "title": "it’s your world,\nwe just live in it",
    "subtitle": "a thoughtful approach to insurance solutions",
    "blurb":
      "We understand the importance of being a value generator. We are inspired by technology, creating efficiency and ensuring this translates to the optimisation of your revenue, workflows and customer offering.\nSustainable businesses are built on strong relationships, and that’s why honesty, transparency and flexibility are so central to our approach. While we’re excited to guide your clients with our expertise, we’re not here to tell them what to do. We design solutions with people, for people, and our service stays nimble so your clients’ expectations are continually met."
  },
  "home": {
    "title":
      "powerfully simple. simply powerful.\nwe’re making it easier to feel connected to your insurance."
  },
  "tech": {
    "title": "tech to enable",
    "subtitle":
      "an agile and highly scalable broker and partner\nuser experience is on its way",
    "blurb":
      "We’re focused on creating best-in-class technology solutions, enabling you to interact with us on your terms. We know that you have preferred ways of working and distribution partners have their preferred approach to integration, so instead of disrupting that, we want to complement it so that every interaction you have with us is simple."
  }
}
