{
  "group": {
    "title": "group personal accident",
    "blurb":
      "Group Personal Accident and Sickness insurance covers a group of people bound by a common interest such as an employer, association or industry.\nblend’s personal accident and sickness policy offers a range of benefits that can be tailored to meet the needs of any group, providing insured people with financial support when it’s needed most.\nIn the event of injury or sickness, benefits are payable in the form of lump sum or weekly benefits. The policy also allows for a number of corporate protection benefits in instances where the client has been impacted by an injury or sickness suffered by an employee.",
    "keyFeatures": [
      "Accidental death",
      "Weekly benefits for sickness and injury",
      "Sickness and injury resulting in surgery",
      "Injury resulting in fractured bones",
      "Injury resulting in loss or damage to teeth",
      "Personal wellbeing - 17 benefit categories including accidental HIV infection, rehabilitation and financial advice benefits.",
      "Corporate protection including corporate image, repatriation and staff recruitment benefits."
    ]
  },
  "personal": {
    "title": "individual personal accident",
    "blurb":
      "Our Individual Personal Accident product covers a variety of occupations. The product provides lump sum benefits due to death or permanent disability from accidental injury and weekly benefits for temporary disablement due to accidental, injury or sickness.\nEven if you already hold some type of insurance, your existing policies may not cover you for serious accidents that can prevent you from continuing your busy lifestyle or returning to work. A serious injury can have a huge impact on you and your family due to medical expenses, reduced income, and your inability to return to normal duties at work.\nBlend Personal Accident Insurance provides a lump sum payout on eligible claims regardless of whether you return to work or not. This cover provides certainty in what is often a very uncertain and unsettling time.",
    "keyFeatures": [
      "No medical forms",
      "Flexible premiums and adjustable cover",
      "Lump sum cash payment under the Serious Accident Benefit depending on the level of cover chosen",
      "Lump sum cash payment on all eligible claims.",
      "Use the cash payments however you like – no restrictions",
      "Pays regardless of other insurance products you may have",
      "Global cover 24/7, even if you’re overseas on holiday",
      "Emergency Assistance - Unlimited access to our emergency assistance team",
      "Provide access to medical practitioners for emergency assistance and advice",
      "Arrange emergency medical evacuations as a direct result of an injury or sickness",
      "Arrange for an accompanying person to travel with and/or remain with an insured person suffering from an injury or sickness",
      "Provide payment guarantees and insurance verification to hospitals",
      "Repatriation to the insured person’s country of residence or a more suitable medical facility following an injury or sickness",
      "On-going medical monitoring"
    ]
  },
  "voluntary": {
    "title": "voluntary workers",
    "blurb":
      "Volunteers have an important role and are not eligible for Workers Compensation. Our product provides protection against financial loss if an injury occurs whilst conducting voluntary work.\nWhile an unpaid worker is not covered by workers compensation, they still face the risk of injury while performing their duties. This could prevent them from participating in their usual paid employment and leave them susceptible to substantial expenses. A comprehensive voluntary workers policy will ensure associations meet their duty of care obligations to this valuable resource.",
    "keyFeatures": [
      "Accidental death",
      "Weekly benefits for sickness and injury",
      "Sickness and injury resulting in surgery",
      "Injury resulting in fractured bones",
      "Injury resulting in loss or damage to teeth",
      "Personal wellbeing – 17 benefit categories including accidental HIV infection, rehabilitation and financial advice benefits.",
      "Corporate protection including corporate image, repatriation and staff recruitment benefits."
    ]
  },
  "journey": {
    "title": "journey",
    "blurb":
      "Where an employee is excluded from journey cover under their state’s Workers Compensation system, Journey cover provides a lump sum benefit in the event of death or permanent disability, or weekly benefits in the event of accidental injury sustained while travelling to and from work.\nOur Journey policy protects employees in transit to and from their place of work if Workers’ Compensation doesn’t provide cover. Choose between capital benefits cover or weekly benefits for injury or illness.",
    "keyFeatures": [
      "Weekly loss of income benefits following an injury",
      "Rehabilitation benefit",
      "Relocation, home and motor modification expenses following permanent disability",
      "Domestic and home help expenses",
      "Credit card debt payment",
      "Compensation for broken bones",
      "Lump sum payment for death or permanent disability resulting from injury or disappearance",
      "Cover for funeral expense"
    ]
  },
  "business": {
    "title": "business travel",
    "blurb":
      "Our Business Travel Insurance product covers expenses for medical treatment, emergency medical evacuation and assistance, flight cancellations and lost luggage for employees whilst travelling for business.\nManaging the risks associated with employees travelling to perilous or remote locations can be particularly challenging. In the event of a serious medical condition, natural disaster or political unrest, a swift response and evacuation are imperative. blend Business Travel Insurance provides cover for employees travelling for business purposes and is designed to cover almost any mishap.\nWhen purchasing Blend corporate travel insurance, a company’s employees are immediately covered by our emergency assistance services.",
    "keyFeatures": [
      "Personal Accident & Sickness - Includes weekly benefits due to sickness or injury, accidental death and other lump sum capital benefits",
      "Kidnap, Ransom, Extortion Hijack & Detention - Includes kidnap, ransom and extortion and a daily hijack and detention benefit",
      "Overseas Medical Expenses & Medical Evacuation Expenses",
      "Baggage, Portable Electronic Equipment & Money - Includes travel documents and deprivation of baggage cover",
      "Travel Disruption - Includes missed connection, loss of deposit, cancellation and curtailment and alternative employee benefits",
      "Corporate Protection - Benefits include corporate image protection, repatriation & funeral expenses and staff recruitment benefits",
      "Rental Vehicle Excess Waiver - Covers the excess payable in the event of loss or damage to a rental vehicle",
      "Personal Liability",
      "Extra Territorial Workers Compensation - Cover for differences in workers compensation entitlements when employees are travelling inter-state within Australia",
      "Personal Wellbeing - A range of additional benefits including accidental HIV infection, rehabilitation and financial advice benefits",
      "Emergency Assistance - Unlimited access to our emergency assistance team",
      "Provide access to medical practitioners for emergency assistance and advice",
      "Arrange emergency medical evacuations as a direct result of an injury or sickness",
      "Arrange for an accompanying person to travel with and/or remain with an insured person suffering from an injury or sickness",
      "Provide payment guarantees and insurance verification to hospitals",
      "Repatriation to the insured person’s country of residence or a more suitable medical facility following an injury or sickness",
      "On-going medical monitoring"
    ]
  },
  "bespoke": {
    "title": "bespoke",
    "blurb":
      "If your client has particular needs that can’t be met by our market-aligned products, we’ll work with you to tailor bespoke solutions in a transparent and consultative way.\nAt blend, we service the market needs of today while designing products for tomorrow. If you have a product concept or idea that answers a specific unmet market need and you’d like to validate it, get in touch so we can bring it to life together.\nIt’s our priority to develop both corporate and consumer solutions that complement one another by addressing both markets, to avoid overlapping and confusion. If it’s not designed to simplify and improve the user experience, it’s not blend."
  }
}
